TsuReX/baremetal/boards/checkboard_lpc54618j512/flash_programmer/flash_programmer.c
    /*!< Set up dividers */
    CLOCK_SetClkDiv(kCLOCK_DivAhbClk, 1U, false);  /*!< Reset divider counter and set divider to value 1 */
    CLOCK_SetClkDiv(kCLOCK_DivUsb0Clk, 0U, true);  /*!< Reset USB0CLKDIV divider counter and halt it */
    CLOCK_SetClkDiv(kCLOCK_DivUsb0Clk, 1U, false); /*!< Set USB0CLKDIV divider to value 1 */

    /*!< Set up clock selectors - Attach clocks to the peripheries */
    CLOCK_AttachClk(kSYS_PLL_to_MAIN_CLK); /*!< Switch MAIN_CLK to SYS_PLL */
    CLOCK_AttachClk(kFRO_HF_to_USB0_CLK);  /*!< Switch USB0_CLK to FRO_HF */
    SYSCON->MAINCLKSELA =
        ((SYSCON->MAINCLKSELA & ~SYSCON_MAINCLKSELA_SEL_MASK) |
         SYSCON_MAINCLKSELA_SEL(0U)); /*!< Switch MAINCLKSELA to FRO12M even it is not used for MAINCLKSELB */
    /* Set SystemCoreClock variable. */
    SystemCoreClock = BOARD_BOOTCLOCKPLL180M_CORE_CLOCK;
}

/*******************************************************************************
 * Variables
 ******************************************************************************/
volatile uint32_t g_systickCounter;

WEAK_AV void SysTick_Handler(void)
{
    if (g_systickCounter != 0U) {
        g_systickCounter--;
    }
}

void SysTick_DelayTicks(uint32_t n)
{
    g_systickCounter = n;
    while (g_systickCounter != 0U) {
    }
}

int main(void)
{
    /* attach 12 MHz clock to FLEXCOMM0 (debug console) */
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM0);

    CLOCK_EnableClock(kCLOCK_Gpio5);

    BOARD_InitPins();
    BOARD_BootClockPLL180M();

    /* Print a note to terminal. */

    /* Init output LED GPIO. */
    GPIO_PortInit(GPIO, 5);

    gpio_pin_config_t hl1 = { kGPIO_DigitalOutput, 0};
    GPIO_PinInit(GPIO, 5, 0, &hl1);
    GPIO_PinWrite(GPIO, 5, 0, 1);

    gpio_pin_config_t hl2 = { kGPIO_DigitalOutput, 0};
    GPIO_PinInit(GPIO, 5, 1, &hl2);
    GPIO_PinWrite(GPIO, 5, 1, 0);

    /* Port masking */
//    GPIO_PortMaskedSet(GPIO, APP_BOARD_TEST_LED_PORT, 0x0000FFFF);
//    GPIO_PortMaskedWrite(GPIO, APP_BOARD_TEST_LED_PORT, 0xFFFFFFFF);
//    port_state = GPIO_PortRead(GPIO, APP_BOARD_TEST_LED_PORT);
//    PRINTF("\r\n Standard port read: %x\r\n", port_state);
//    port_state = GPIO_PortMaskedRead(GPIO, APP_BOARD_TEST_LED_PORT);
//    PRINTF("\r\n Masked port read: %x\r\n", port_state);

    /* Set systick reload value to generate 1ms interrupt */
    if (SysTick_Config(SystemCoreClock / 1000U)) {
        while (1) {
        }
    }

    while (1) {
//        port_state = GPIO_PortRead(GPIO, APP_SW_PORT);
//        if (!(port_state & (1 << APP_SW_PIN))) {
            GPIO_PortToggle(GPIO, 5, 3);
//        }
        SysTick_DelayTicks(1000U);
    }
}

